Tekla.Structures.Model.CustomPart
The CustomPart class represents a custom part object in the Tekla Structures model.
A custom part is a modeling tool that typically assembles multiple parts to build some
type of a beam-like structure, for example a tapered beam or a sandwich panel.
using Tekla.Structures.Model;
using Tekla.Structures.Geometry3d;
public class Example
{
public void Example1()
{
CustomPart CPart = new CustomPart();
CPart.Name = "HPKM39";
CPart.Number = BaseComponent.CUSTOM_OBJECT_NUMBER;
CPart.Position.Plane = Position.PlaneEnum.LEFT;
CPart.Position.PlaneOffset = 10;
CPart.Position.Depth = Position.DepthEnum.BEHIND;
CPart.Position.DepthOffset = 30;
CPart.Position.RotationOffset = 45;
CPart.Position.Rotation = Position.RotationEnum.TOP;
CPart.SetInputPositions(new Point(100, 0, 0), new Point(300, 0, 0));
CPart.SetAttribute("P2a", "TEST");
CPart.Insert();
}
}

Tekla.Structures.Model.CustomPart.Position
The way the custom part is positioned in the model.
Remarks: Currently position attributes cannot be changed with Modify().

Tekla.Structures.Model.CustomPart.#ctor
Creates a new custom part instance.

Tekla.Structures.Model.CustomPart.#ctor(Tekla.Structures.Geometry3d.Point,Tekla.Structures.Geometry3d.Point)
Creates a new custom part instance with the given input.
StartPoint: The start point of the custom part.
EndPoint: The end point of the custom part.

Tekla.Structures.Model.CustomPart.SetInputPositions(Tekla.Structures.Geometry3d.Point,Tekla.Structures.Geometry3d.Point)
Sets the start and end point of the custom part.
StartPoint: The start point of the custom part.
EndPoint: The end point of the custom part.
Returns: True on success.

Tekla.Structures.Model.CustomPart.GetStartAndEndPositions(Tekla.Structures.Geometry3d.Point@,Tekla.Structures.Geometry3d.Point@)
Returns the start and end points of the custom part.
StartPoint: The start point of the custom part.
EndPoint: The end point of the custom part.
Returns: True on success.

Tekla.Structures.Model.CustomPart.GetBooleans
Returns an enumerator of all the connected boolean objects.
Returns: A model object enumerator on success, otherwise null.

Tekla.Structures.Model.CustomPart.GetAssembly
Returns the assembly that the custom part belongs to.
Returns: The assembly that the custom part belongs to.

Tekla.Structures.Model.CustomPart.Insert
Inserts the custom part into the model database.
Returns: True on success.

Tekla.Structures.Model.CustomPart.Select
Selects a custom part from the model database. The custom part identifier must be set.
Returns: True on success.

Tekla.Structures.Model.CustomPart.Modify
Modifies the existing custom part in the model database to match the current one.
Remarks: Currently position attributes cannot be changed with Modify().
Returns: True on success.

Tekla.Structures.Model.CustomPart.Delete
Deletes the custom part instance with the given identifier from the model database.
Returns: True on success.

Tekla.Structures.Model.CustomPart.GetComponents
Returns an enumerator of all the connected components.
Returns: A ModelObjectEnumerator on success, otherwise null.